tap "homebrew/bundle"
brew "asdf"
brew "bitwarden-cli"
brew "direnv"
brew "fzf"
brew "git"
brew "gnupg"
brew "hub"
brew "ollama"
brew "starship"
brew "tlrc"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "alt-tab"
cask "ngrok"
cask "notunes"
cask "orbstack"
cask "rectangle"
