tap "filosottile/musl-cross"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "tankerhq/repo"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Perl compatible regular expressions library
brew "pcre"
# Tool for changing code across many languages
brew "comby"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Asynchronous event library
brew "libevent"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Core application library for C
brew "glib"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Database migrations CLI tool
brew "golang-migrate"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# YAML Parser
brew "libyaml"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql", restart_service: true
# NCurses Disk Usage
brew "ncdu"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Development kit for the Java programming language
brew "openjdk"
# Web-based PostgreSQL database browser
brew "pgweb"
# Object-relational database system
brew "postgresql", restart_service: true
# Object-relational database system
brew "postgresql@9.5"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Install various Ruby versions and implementations
brew "ruby-build"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Linux cross compilers based on musl libc
brew "filosottile/musl-cross/musl-cross"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Find and replace text in source files
brew "tankerhq/repo/ruplacer"
cask "java"
cask "java8"
cask "pgweb"
# Standalone app for debugging React Native apps
cask "react-native-debugger"
